Revit 2024 API
View.AreAnnotationCategoriesHidden Property
 Indicates if annotation categories are currently hidden in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool AreAnnotationCategoriesHidden { get; set; }
Visual Basic
Public Property AreAnnotationCategoriesHidden As Boolean
	Get
	Set
Visual C++
public:
property bool AreAnnotationCategoriesHidden {
	bool get ();
	void set (bool value);
}
Field Value
 True if annotation categories are currently hidden in the view, false otherwise.
See Also
View Class
Autodesk.Revit.DB Namespace